<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>

<body>
        <a href="https://wda.mackliu.com/s1120407/backhomework0119/index.php">
        選擇飲料轉盤網站設計 (作品網址)
        </a>
        <pre>
        台灣排行榜飲料店網站，管理者可以更新標題圖片和輪播圖。也有每家飲料店菜單及網站連結，方便使用者查看。
        輪盤選飲料功能：可以透過網站上的輪盤功能，挑選今天想享用的飲料。此項功能不僅提供了娛樂性，也可以解決不知道喝什麼飲料的煩惱。
        指定飲料店功能：新增了選擇飲料店的功能，可以選擇今天想品嚐的飲料店。
        政府API串接：結合政府的環保杯子優惠資訊。透過串接政府API，您可以迅速查找那些提供環保杯子優惠的店家，同時為環保盡一份心力。
        即時客流數據：現在網站上已新增即時客流數據顯示。
        </pre>
        <a href="https://wda.mackliu.com/s1120407/temple/index.php">
        公廟購物網站 (作品網址)
        </a>
        <pre>
        使用Bootstrap 5打造首頁，輪播圖。透過導覽列點選，輕鬆跳轉至相應路徑。首頁內容涵蓋：
        服務、熱銷產品、活動最新消息、歷史活動、相關問題、網路點燈
        導覽影片、活動照片、聯絡地址。
        除此之外，還有以下功能： 
        會員註冊 (建立到資料庫)
        會員登入包含驗證碼功能（包含文字和數字加減的驗證碼）
        購物車功能：使用者可註冊帳號後登入，自由選購商品、加入購物車並提交訂單。
        後端管理者登入後，輕鬆管理相關產品頁面，包括大分類和小分類。最後，管理者能夠將客戶訂單輸出成json或者csv格式。
        </pre>
</body>

</html>